#include <iostream>
 
int main() {
    int balance = 1000;
 
    // TODO: создай две ссылки на balance: account1 и account2
 
    // Вычти из account1 500, выведи account2 на экран.
 
    // TODO: создай переменную friendBalance и присвой ей значение 300.


    // TODO: попробуй написать account1 = friendBalance;
    // Подумай (и напиши в комментарии) — это ПЕРЕПРИВЯЗКА ссылки
    // или ПРИСВАИВАНИЕ ЗНАЧЕНИЯ? Что реально произойдёт с balance?
    //
    // Ответ:
 
    // TODO (для сравнения): сделай то же самое через указатели
    // вот ЭТО сработает как переключение — почему?
}