#include <iostream>

int main() {
    int coords[4] = {55, 37, 60, 30};

    /*
        1. Поставить указатель на первый [1] элемент массива coords.
        2. Вывести на экран значение первого элемента массива через указатель.
        3. Переместить указатель на последний [3] элемент массива.
        4. Вывести на экран значение последнего элемента массива через указатель.
        5. Убедиться, что сам массив не поменялся.
    */

    for (const auto& coord : coords) {  // Range-based цикл для вывода элементов массива
        std::cout << coord << " ";
    }
    std::cout << std::endl;

    return 0;
}